In [7]:
import pandas as pd
import os

In [8]:
os.listdir()

['.ipynb_checkpoints',
 'AirPassengers.csv',
 'buffet_details_extended.csv',
 'churn_data.csv',
 'heart.csv',
 'Modified_Superstore.csv',
 'Pandas Apply and Pivot Table.ipynb',
 'Pandas Merge_Joins.ipynb',
 'RandomSales.xlsx',
 'Superstore.csv']

In [10]:
result = pd.read_excel("RandomSales.xlsx", sheet_name=None)
# when your sheet_name = None, then above live returns an output in the form dictionary

In [11]:
type(result)

dict

In [12]:
result.keys()

dict_keys(['Orders', 'Returns', 'upGrad', 'Ankita'])

In [18]:
pd.ExcelFile("RandomSales.xlsx").sheet_names

['Orders', 'Returns', 'upGrad', 'Ankita']

In [19]:
pd.ExcelFile("Random_Sales.xlsx").sheet_names

['Orders', 'Amit', 'Pushpanjali', 'Om', 'Returns', 'upGrad', 'Ankita']

In [20]:
orders = pd.read_excel("RandomSales.xlsx", sheet_name="Orders")

In [21]:
orders.shape

(5000, 5)

In [22]:
returns = pd.read_excel("RandomSales.xlsx", sheet_name="Returns")

In [23]:
returns.shape

(2000, 4)

In [24]:
orders.head(2)

         Order ID       Customer       City  Quantity  Price
0  NJ-2016-152156  Raymond Young       Troy         6  12.42
1  NJ-2016-138688     Helen Dean  Westfield         7  17.83

In [25]:
returns.head(2)

         Order ID       Customer       City       State
0  NJ-2016-273214  Raymond Young       Troy    New York
1  NJ-2016-271456     Helen Dean  Westfield  New Jersey

## pd.merge
* Inner Join : Common record between the dataset (both dataframe)
* Left Join : Left DataFrame records including matching record
* Right Join : Right DataFrame records including matching record
* OuterJoin : (Right DataSet + Left Data Set) - Matching Record
* Cross Join : Cartesian Product : LeftData(10), RightData(5) => 50 Rec

In [27]:
inner_join = pd.merge(left = orders, right = returns, how = "inner",
                     on = "Order ID")

In [28]:
inner_join.shape

(89, 8)

In [29]:
inner_join.head()

,Order ID,Customer_x,City_x,Quantity,Price,Customer_y,City_y,State
0,WA-2016-117590,Judy Sanchez,Seattle,7,53.35,Judy Sanchez,Seattle,Washington
1,WA-2015-117415,Harold Hunter,Seattle,4,12.42,Harold Hunter,Seattle,Washington
2,MA-2017-120999,Lori Shaw,Lowell,7,16.32,Lori Shaw,Lowell,Massachusetts
3,NJ-2016-101343,Sandra Hicks,Troy,1,53.35,Sandra Hicks,Troy,New York
4,MA-2017-139619,Roger Gomez,Lowell,7,16.32,Roger Gomez,Lowell,Massachusetts

In [31]:
inner_join = pd.merge(left = orders, right = returns[["Order ID","State"]],
                      how = "inner",on = "Order ID")

In [32]:
inner_join.shape

(89, 6)

In [33]:
inner_join.head()

         Order ID       Customer     City  Quantity  Price          State
0  WA-2016-117590   Judy Sanchez  Seattle         7  53.35     Washington
1  WA-2015-117415  Harold Hunter  Seattle         4  12.42     Washington
2  MA-2017-120999      Lori Shaw   Lowell         7  16.32  Massachusetts
3  NJ-2016-101343   Sandra Hicks     Troy         1  53.35       New York
4  MA-2017-139619    Roger Gomez   Lowell         7  16.32  Massachusetts

### Left Join : All the records from left including matching recs

In [39]:
left_join = pd.merge(left = orders, right = returns[["Order ID","State"]],
                      how = "left",on = "Order ID",indicator=True)

In [40]:
left_join.shape

(5000, 7)

In [41]:
left_join.head()

,Order ID,Customer,City,Quantity,Price,State,_merge
0,NJ-2016-152156,Raymond Young,Troy,6,12.42,NaN,left_only
1,NJ-2016-138688,Helen Dean,Westfield,7,17.83,NaN,left_only
2,WA-2015-108966,Shirley Chavez,Seattle,2,53.35,NaN,left_only
3,NJ-2014-115812,Brian Ryan,Westfield,1,53.35,NaN,left_only
4,NJ-2017-114412,Benjamin Willis,Westfield,3,17.83,NaN,left_only

In [43]:
left_join["_merge"].value_counts().reset_index()

       _merge  count
0   left_only   4911
1        both     89
2  right_only      0

### Right Join:  All the records from right - including matching recs

In [44]:
returns.shape

(2000, 4)

In [46]:
right_join = pd.merge(left = orders[["Order ID","Price"]],right = returns,
                      how = "right",on = "Order ID",indicator=True)

In [47]:
right_join.shape

(2000, 6)

In [48]:
right_join.head()

         Order ID  Price         Customer       City       State      _merge
0  NJ-2016-273214    NaN    Raymond Young       Troy    New York  right_only
1  NJ-2016-271456    NaN       Helen Dean  Westfield  New Jersey  right_only
2  WA-2015-451988    NaN   Shirley Chavez    Seattle  Washington  right_only
3  NJ-2014-352961    NaN       Brian Ryan  Westfield  New Jersey  right_only
4  NJ-2017-213231    NaN  Benjamin Willis  Westfield  New Jersey  right_only

In [49]:
right_join["_merge"].value_counts().reset_index()

       _merge  count
0  right_only   1911
1        both     89
2   left_only      0

In [50]:
sum(right_join["_merge"] == "both")

89

In [51]:
right_join[right_join["_merge"] == "both"]

,Order ID,Price,Customer,City,State,_merge
16,WA-2016-117590,53.35,Judy Sanchez,Seattle,Washington,both
17,WA-2015-117415,12.42,Harold Hunter,Seattle,Washington,both
18,MA-2017-120999,16.32,Lori Shaw,Lowell,Massachusetts,both
19,NJ-2016-101343,53.35,Sandra Hicks,Troy,New York,both
20,MA-2017-139619,16.32,Roger Gomez,Lowell,Massachusetts,both
...,...,...,...,...,...,...
1447,NJ-2014-113929,16.32,Randy Willis,Westfield,New Jersey,both
1473,MA-2017-167941,16.32,Kenneth Nelson,Lowell,Massachusetts,both
1499,OR-2016-160528,12.42,Henry Day,Portland,Oregon,both
1525,WA-2017-106859,53.35,Jennifer Adams,Seattle,Washington,both
1551,WA-2014-136399,17.83,Stephanie Wallace,Seattle,Washington,both

In [52]:
right_join[right_join["_merge"] != "both"]

,Order ID,Price,Customer,City,State,_merge
0,NJ-2016-273214,NaN,Raymond Young,Troy,New York,right_only
1,NJ-2016-271456,NaN,Helen Dean,Westfield,New Jersey,right_only
2,WA-2015-451988,NaN,Shirley Chavez,Seattle,Washington,right_only
3,NJ-2014-352961,NaN,Brian Ryan,Westfield,New Jersey,right_only
4,NJ-2017-213231,NaN,Benjamin Willis,Westfield,New Jersey,right_only
...,...,...,...,...,...,...
1995,OR-2014-443372,NaN,Kevin Garza,Portland,Oregon,right_only
1996,MA-2015-302053,NaN,Walter Kennedy,Lowell,Massachusetts,right_only
1997,NJ-2015-406754,NaN,Shirley Morrison,Troy,New York,right_only
1998,CA-2017-214601,NaN,Rachel Stanley,Los Angeles,California,right_only
1999,OR-2015-206233,NaN,Teresa Fisher,Portland,Oregon,right_only

In [53]:
full_join = pd.merge(left = orders[["Order ID","Price"]],right = returns,
                      how = "outer",on = "Order ID",indicator=True)

In [54]:
full_join.shape

(6911, 6)

In [55]:
full_join._merge.value_counts().reset_index()

       _merge  count
0   left_only   4911
1  right_only   1911
2        both     89

In [59]:
salary = pd.read_excel("Random_Sales_2.xlsx","Salary")

In [61]:
salary.head()

   EmpID   EmpName  Salary
0    600  Abhishek   53218
1    322     Manya   52981
2    148    Ashish   51566
3    705     Ajeet   52882
4    330      Aman   53744

In [64]:
salary.shape

(12, 3)

In [62]:
incentive = pd.read_excel("Random_Sales_2.xlsx","Incentive")

In [63]:
incentive

   EmpID   EmpName  Incentive
0    600  Abhishek       1162
1    322     Manya       1170
2    148    Ashish       1146
3    999      Eric       1137
4    330      Aman       1343
5    789      Paul       1086
6    245  Michelle       1021
7    474    Ramesh       1459
8    495    Somesh       1071
9    121     Lucas       1346

In [69]:
# Salary -> 12 and Incentive : 10
inner = pd.merge(left = salary, right = incentive[["EmpID","Incentive"]],
                how ='inner',on = "EmpID")

In [70]:
inner

   EmpID   EmpName  Salary  Incentive
0    600  Abhishek   53218       1162
1    322     Manya   52981       1170
2    148    Ashish   51566       1146
3    330      Aman   53744       1343
4    474    Ramesh   50038       1459
5    495    Somesh   53901       1071

In [74]:
# Salary -> 12 and Incentive : 10
left = pd.merge(left = salary, right = incentive[["EmpID","Incentive"]],
                how ='left',on = "EmpID", indicator=True)

In [75]:
left.shape

(12, 5)

In [76]:
left

    EmpID   EmpName  Salary  Incentive     _merge
0     600  Abhishek   53218     1162.0       both
1     322     Manya   52981     1170.0       both
2     148    Ashish   51566     1146.0       both
3     705     Ajeet   52882        NaN  left_only
4     330      Aman   53744     1343.0       both
5     755      Raja   51008        NaN  left_only
6     800      Raju   54494        NaN  left_only
7     474    Ramesh   50038     1459.0       both
8     504    Suresh   50136        NaN  left_only
9     104     Ajeet   50013        NaN  left_only
10    583    Mahesh   50434        NaN  left_only
11    495    Somesh   53901     1071.0       both

In [77]:
left._merge.value_counts()

_merge
left_only     6
both          6
right_only    0
Name: count, dtype: int64

In [79]:
# Salary -> 12 and Incentive : 10
right = pd.merge(left = salary[["EmpID","Salary"]], right = incentive,
                how ='right',on = "EmpID", indicator=True)

In [80]:
right.shape

(10, 5)

In [81]:
right

   EmpID   Salary   EmpName  Incentive      _merge
0    600  53218.0  Abhishek       1162        both
1    322  52981.0     Manya       1170        both
2    148  51566.0    Ashish       1146        both
3    999      NaN      Eric       1137  right_only
4    330  53744.0      Aman       1343        both
5    789      NaN      Paul       1086  right_only
6    245      NaN  Michelle       1021  right_only
7    474  50038.0    Ramesh       1459        both
8    495  53901.0    Somesh       1071        both
9    121      NaN     Lucas       1346  right_only

In [82]:
right._merge.value_counts()

_merge
both          6
right_only    4
left_only     0
Name: count, dtype: int64

In [83]:
# Salary -> 12 and Incentive : 10
full = pd.merge(left = salary[["EmpID","Salary"]], right = incentive,
                how ='outer',on = "EmpID", indicator=True)

In [84]:
full.shape

(16, 5)

In [85]:
full._merge.value_counts()

_merge
left_only     6
both          6
right_only    4
Name: count, dtype: int64

In [86]:
# Salary -> 12 and Incentive : 10
cross = pd.merge(left = salary[["EmpID","Salary"]], right = incentive,
                how ='cross', indicator=True)

In [87]:
cross.shape

(120, 6)

*********************** End Of Pandas ****************************

### Pandas Playlist:

https://www.youtube.com/playlist?list=PLWuFHho1zKhUJpe9WfSyvrrQrzqDErbmv